//=====================================================================
// 
// fade.cppのヘッダファイル [fade.h]
// Author : Kaito Iwasaki
//
//=====================================================================
#ifndef _FADE_H_
#define _FADE_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "scene.h"
#include "baseObject.h"

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************
typedef enum
{
	FADESTATE_NONE = 0,
	FADESTATE_IN,
	FADESTATE_OUT,
	FADESTATE_MAX
}FADESTATE;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	BASEOBJECT obj;
	FADESTATE state;	// フェード状態
	float fFadeScale;	// フェード速度
	SCENE sceneNext;	// 次のシーン設定用
	bool bStopSound;	// 音声停止フラグ
}FADE;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitFade(SCENE sceneNext);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(SCENE sceneNext, bool bStopSound = true);
FADE GetFade(void);

#endif