//=====================================================================
//
// font.cppのヘッダファイル [font.h]
// Author : Kaito Iwasaki
// 
//=====================================================================
#ifndef _FONT_H_
#define _FONT_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "baseObject.h"
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_FONT		(64)
#define MAX_TEXTCHAR	(256)

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
typedef enum
{
	FONT_LABEL_TERMINAL = 0,
	FONT_LABEL_DONGURI,
	FONT_LABEL_MAX
}FONT_LABEL;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	LPD3DXFONT font;

	BASEOBJECT obj;
	FONT_LABEL type;
	bool bUsed;
	int nID;
	char aText[MAX_TEXTCHAR];
	UINT format;
}FONT;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitFont(void);
void UninitFont(void);
void DrawFont(void);
FONT* GetFont(void);
FONT* SetFont(
	FONT_LABEL type,		// 使用するフォント
	D3DXVECTOR3 pos,		// 位置
	D3DXVECTOR3 size,		// サイズ
	D3DXCOLOR col,			// 色
	int nScale,				// テキストのサイズ4
	const char* aText,		// 表示するテキスト
	UINT format				// テキストフォーマット
);
void DeleteFont(int nID);
void DeleteFont(void);

#endif