//=====================================================================
//
// game.cppのヘッダファイル [game.h]
// Author : Kaito Iwasaki
// 
//=====================================================================
#ifndef _GAME_H_
#define _GAME_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define GAME_GRAVITY	(0.7f)

// スコア加算値
#define SCORE_CHECKPOINT_REACHED			(300)	// チェックポイント到達時
#define SCORE_CHECKPOINT_HALF_REACHED		(600)	// 折り返しチェックポイント到達時
#define SCORE_GOAL_REACHED					(1000)	// ゴール時
#define SCORE_COIN							(100)	// コイン取得時

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************
//*********************************************************************
// ゲーム状態列挙型
//*********************************************************************
typedef enum
{
	GAMESTATE_NORMAL = 0,
	GAMESTATE_OVER,
	GAMESTATE_CLEAR,
	GAMESTATE_END,
	GAMESTATE_MAX
}GAMESTATE;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);
void SetGameState(GAMESTATE state);
void ReloadGameModel(void);
void TogglePauseGame(bool bPause);
void AddScore(int nScore);

#endif