//=====================================================================
//
// 光源処理 [light.cpp]
// Author : Kaito Iwasaki
// 
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "light.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************
D3DLIGHT9 g_aLight[MAX_LIGHT];

//=====================================================================
// 初期化処理
//=====================================================================
void InitLight(void)
{
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	D3DXVECTOR3 vecDir;

	// ライトの情報をクリアする
	ZeroMemory(&g_aLight[0], sizeof(g_aLight));

	// ライトの種類を設定
	g_aLight[0].Type = D3DLIGHT_DIRECTIONAL;
	g_aLight[1].Type = D3DLIGHT_DIRECTIONAL;
	g_aLight[2].Type = D3DLIGHT_DIRECTIONAL;

	// ライトの拡散光を設定
	g_aLight[0].Diffuse = D3DXCOLOR(0.6f, 0.6f, 0.6f, 1.0f);
	g_aLight[1].Diffuse = D3DXCOLOR(0.3f, 0.3f, 0.3f, 1.0f);
	g_aLight[2].Diffuse = D3DXCOLOR(0.3f, 0.3f, 0.3f, 1.0f);

	// ライトの方向を設定
	vecDir = D3DXVECTOR3(0.2f, -0.8f, -0.4f);
	D3DXVec3Normalize(&vecDir, &vecDir);
	g_aLight[0].Direction = vecDir;
	vecDir = D3DXVECTOR3(-0.0f, -1.0f, 0.0f);
	D3DXVec3Normalize(&vecDir, &vecDir);
	g_aLight[1].Direction = vecDir;
	vecDir = D3DXVECTOR3(0.0f, 0.0f, 1.0f);
	D3DXVec3Normalize(&vecDir, &vecDir);
	g_aLight[2].Direction = vecDir;

	// ライトを設定する
	pDevice->SetLight(0, &g_aLight[0]);
	pDevice->SetLight(1, &g_aLight[1]);
	pDevice->SetLight(2, &g_aLight[2]);

	// ライトを有効にする
	pDevice->LightEnable(0, TRUE);
	pDevice->LightEnable(1, TRUE);
	pDevice->LightEnable(2, TRUE);
}

//=====================================================================
// 終了処理
//=====================================================================
void UninitLight(void)
{

}

//=====================================================================
// 更新処理
//=====================================================================
void UpdateLight(void)
{

}