//=====================================================================
//
// meshfield.cppのヘッダファイル [meshfield.h]
// Author : 
// 
//=====================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"
#include "util.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_MESHFIOELD		(512)

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct 
{
	BASEOBJECT obj;
	D3DXMATRIX mtxWorld;
	LPDIRECT3DVERTEXBUFFER9 pVtxBuff;
	int nType;
	int nSegmentX;
	int nSegmentZ;
	bool bUsed;
}MESHFIELD;

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitMeshField(void);
void UninitMeshField(void);
void UpdateMeshField(void);
void DrawMeshField(void);
void SetMeshField(int nType, D3DXVECTOR3 pos, D3DXVECTOR3 size, int nSegmentX, int nSegmentZ);

#endif