//=====================================================================
//
// model.cppのヘッダファイル [model.h]
// Author : 
// 
//=====================================================================
#ifndef _MODEL_H_
#define _MODEL_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"
#include "script_loader.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_TEXTURE_PER_MODEL		(16)
#define MAX_MODEL					(1024)

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	BASEOBJECT obj;
	D3DXMATRIX mtxWorld;
	LPD3DXMESH pMesh;
	LPDIRECT3DTEXTURE9 apTexture[MAX_TEXTURE_PER_MODEL];
	LPD3DXBUFFER pBuffMat;
	DWORD dwNumMat;
	D3DXVECTOR3 vtxMin, vtxMax;
	bool bUsed;
}MODEL;
//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitModel(void);
void UninitModel(void);
void UpdateModel(void);
void DrawModel(void);
void SetModel(const char* pFilename, D3DXVECTOR3 pos, D3DXVECTOR3 rot);

#endif