//=====================================================================
//
// motion_loader.cppのヘッダファイル [motion_loader.h]
// Author : 
// 
//=====================================================================
#ifndef _MOTION_LOADER_H_
#define _MOTION_LOADER_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "model.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_MOTION_INFO		(32)
#define MAX_KEY_INFO		(32)
#define MAX_PART_PER_KEY	(32)

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	float fPosX;
	float fPosY;
	float fPosZ;
	float fRotX;
	float fRotY;
	float fRotZ;
}KEY;

typedef struct
{
	int nFrame;					// 再生フレーム
	KEY aKey[MAX_PART_PER_KEY];			// 各パーツのキー要素
}KEY_INFO;

typedef struct
{
	bool bLoop;								// ループするかどうか
	int nNumKey;							// キーの総数
	KEY_INFO aKeyInfo[MAX_KEY_INFO];		// キー情報
}MOTION_INFO;


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void LoadMotionScript(const char* pFileName, MOTION_INFO* pBuffer);

#endif