//=====================================================================
//
// motion_loader.cppのヘッダファイル [motion_loader.h]
// Author : 
// 
//=====================================================================
#ifndef _MOTION_LOADER_H_
#define _MOTION_LOADER_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "model.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_MOTION_INFO		(32)
#define MAX_KEY_INFO		(32)
#define MAX_PART_PER_KEY	(32)
#define MAX_PART			(32)

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
//*********************************************************************
// パーツ構造体
//*********************************************************************
typedef struct
{
	LPDIRECT3DTEXTURE9 apTexture[MAX_TEXTURE_PER_MODEL];	// テクスチャへのポインタ
	LPD3DXMESH pMesh;										// メッシュ情報へのポインタ
	LPD3DXBUFFER pBuffMat;									// マテリアルへのポインタ
	DWORD dwNumMat;											// マテリアル数
	int nIdxModelParent;									// 親モデルのインデックス
	int nIdxPart;
	BASEOBJECT obj;
	BASEOBJECT offset;
	D3DXMATRIX mtxWorld;
}PART;

//*********************************************************************
// キー構造体
//*********************************************************************
typedef struct
{
	D3DXVECTOR3 pos;						// 位置
	D3DXVECTOR3 rot;						// 回転
}KEY;

//*********************************************************************
// キー情報構造体
//*********************************************************************
typedef struct
{
	int nFrame;								// 再生フレーム
	KEY aKey[MAX_PART_PER_KEY];				// 各パーツのキー要素
}KEY_INFO;

//*********************************************************************
// モーション情報構造体
//*********************************************************************
typedef struct
{
	bool bLoop;								// ループするかどうか
	int nNumKey;							// キーの総数
	KEY_INFO aKeyInfo[MAX_KEY_INFO];		// キー情報
}MOTION_INFO;

//*********************************************************************
// モーション構造体
//*********************************************************************
typedef struct {
	int nNumPart;
	int nNumMotion;
	char aPartFilename[MAX_PART][MAX_PATH];
	PART aPart[MAX_PART];
	MOTION_INFO aMotionInfo[MAX_MOTION_INFO];
}MOTION;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void LoadMotionScript(const char* pFileName, MOTION* pBuffer);

#endif