//=====================================================================
//
// 画面処理 [scene.cpp]
// Author : Kaito Iwasaki
// 
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "scene.h"
#include "sound.h"
#include "input.h"
#include "fade.h"
#include "camera.h"
#include "light.h"
#include "Title.h"
#include "Game.h"
#include "Result.h"

//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************
SCENE g_currentScene = SCENE_TITLE;			// 現在のシーン
SCENE g_previousScene = g_currentScene;		// 直前のシーン

//*********************************************************************
// 各シーンの処理関数
//*********************************************************************
SCENEDATA g_scenes[SCENE_MAX] = {
	{ InitTitle, UninitTitle, UpdateTitle, DrawTitle },			// タイトル画面
	{ InitGame, UninitGame, UpdateGame, DrawGame },				// ゲーム画面
	{ InitResult, UninitResult, UpdateResult, DrawResult },		// リザルト画面
};

//=====================================================================
// 初期化処理
//=====================================================================
void InitScene(void)
{
	// カメラの初期化処理
	InitCamera();

	// ライトの初期化処理
	InitLight();

	// フェード＆シーンの初期化処理
	InitFade(g_currentScene);
}

//=====================================================================
// 終了処理
//=====================================================================
void UninitScene(void)
{
	// 各シーンの終了処理
	for (int nCount = 0; nCount < SCENE_MAX; nCount++)
	{
		g_scenes[nCount].Uninit();
	}

	// ライトの終了処理
	UninitLight();
	
	// カメラの終了処理
	UninitCamera();

	// フェードのの終了処理
	UninitFade();
}

//=====================================================================
// 更新処理
//=====================================================================
void UpdateScene(void)
{
	// ライトの更新処理
	UpdateLight();

	// カメラの更新処理
	UpdateCamera();

	// 現在のシーンの更新処理
	g_scenes[g_currentScene].Update();

	// フェードの更新処理
	UpdateFade();
}

//=====================================================================
// 描画処理
//=====================================================================
void DrawScene(void)
{
	// カメラの設定処理
	SetCamera();

	// 現在のシーンの描画処理
	g_scenes[g_currentScene].Draw();

	// フェードの描画処理
	DrawFade();
}

//=====================================================================
// シーン設定処理
//=====================================================================
SCENE SetScene(SCENE nextScene, bool bStopSound)
{
	// 直前のシーンを記録
	g_previousScene = g_currentScene;

	// 現在のシーンを終了
	g_scenes[g_currentScene].Uninit();

	// 新規シーンを現在のシーンに設定
	g_currentScene = nextScene;

	// 新規シーンを初期化
	g_scenes[nextScene].Init();

	return g_currentScene;
}

//=====================================================================
// 現在のシーンを取得する処理
//=====================================================================
SCENE GetCurrentScene(void)
{
	return g_currentScene;
}

//=====================================================================
// 直前のシーンを取得する処理
//=====================================================================
SCENE GetPreviousScene(void)
{
	return g_previousScene;
}
