//=====================================================================
//
// script [script.cpp]
// Author : 
// 
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "script.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************


//=====================================================================
// 行の読み取り処理
//=====================================================================
int ReadLine(FILE* pFile, char* pBuffer)
{
	char aStrLine[MAX_READABLE_CHAR] = {};

	if (fgets(&aStrLine[0], sizeof(aStrLine), pFile) == NULL)
	{// 一行読み込む
		return EOF;
	}

	// 改行文字まで読み込む
	sscanf(&aStrLine[0], "%[^\n]", &aStrLine[0]);

	if (strchr(&aStrLine[0], '#') != NULL)
	{// '#'はコメントキーワードとしてそれ以降の文字を切り捨てる
		sscanf(&aStrLine[0], "%[^#]", &aStrLine[0]);
	}

	strcpy(pBuffer, &aStrLine[0]);

	return 0;
}

//=====================================================================
// 文字列の読み取り処理
//=====================================================================
int ReadWord(FILE* pFile, char* pBuffer)
{
	char aStrLine[MAX_READABLE_CHAR] = {};
	
	while (true)
	{
		// 文字列を読み込む
		if (fscanf(pFile, "%s", &aStrLine[0]) == EOF)
		{// ファイルの終端に達したらEOFを返す
			return EOF;
		}

		if (aStrLine[0] == '#')
		{// 読み込んだ文字列の最初の文字がコメントキーワードならその行は読み飛ばして最初に戻る
			if (fgets(&aStrLine[0], sizeof(aStrLine), pFile) == NULL)
			{// ファイルの終端に達していたらEOFを返す
				return EOF;
			}
		}
		else
		{// 何もなければループを抜けて文字列を返す
			break;
		}
	}

	strcpy(pBuffer, &aStrLine[0]);

	return strlen(aStrLine);
}

//=====================================================================
// 文字列から文字列を読み取る処理
//=====================================================================
char* ReadWordFromString(char* pSource, char* pBuffer)
{
	if (sscanf(pSource, "%s", pBuffer) == EOF)
	{
		return NULL;
	}

	return &pSource[strlen(pBuffer)];
}