//=====================================================================
//
// shadow.cppのヘッダファイル [shadow.h]
// Author : 
// 
//=====================================================================
#ifndef _SHADOW_H_
#define _SHADOW_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"
#include "util.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_SHADOW		(1024)

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct SHADOW
{
	BASEOBJECT obj;
	D3DXMATRIX mtxWorld;
	bool bUsed;
}SHADOW;

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitShadow(void);
void UninitShadow(void);
void UpdateShadow(void);
void DrawShadow(void);
int SetShadow(void);
void SetShadowPosition(int nIdxShadow, D3DXVECTOR3 pos);
void SetShadowSize(int nIdxShadow, D3DXVECTOR3 size);
void SetShadowAlpha(int nIdxShadow, float alpha);
void RemoveShadow(int nIdxShadow);

#endif