//=====================================================================
//
// sphere.cppのヘッダファイル [sphere.h]
// Author : 
// 
//=====================================================================
#ifndef _SPHERE_H_
#define _SPHERE_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"
#include "util.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_SPHERE		(512)

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	BASEOBJECT obj;
	D3DXMATRIX mtxWorld;
	LPDIRECT3DVERTEXBUFFER9 pVtxBuff;
	LPDIRECT3DINDEXBUFFER9 pIdxBuff;
	int nTexId;
	int nSegmentX;
	int nSegmentZ;
	bool bUsed;
	int nMaxVtx;
	int nMaxIdx;
}SPHERE;

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitSphere(void);
void UninitSphere(void);
void UpdateSphere(void);
void DrawSphere(void);
void SetSphere(int nTexId, D3DXVECTOR3 pos, D3DXVECTOR3 size, int nSegmentX, int nSegmentZ);

#endif